3w36zj6.textlint
bradlc.vscode-tailwindcss
charliermarsh.ruff
christian-kohler.path-intellisense
cschlosser.doxdocgen
davidanson.vscode-markdownlint
dbaeumer.vscode-eslint
detachhead.basedpyright
esbenp.prettier-vscode
github.copilot
github.copilot-chat
golang.go
james-yu.latex-workshop
kisstkondoros.vscode-gutter-preview
llvm-vs-code-extensions.vscode-clangd
ltex-plus.vscode-ltex-plus
marp-team.marp-vscode
ms-azuretools.vscode-containers
ms-python.debugpy
ms-python.python
ms-python.vscode-python-envs
ms-vscode.cmake-tools
ms-vscode.hexeditor
ms-vscode.makefile-tools
myriad-dreamin.tinymist
nimlang.nimlang
njpwerner.autodocstring
pkief.material-icon-theme
pucelle.vscode-css-navigation
qcz.text-power-tools
redhat.vscode-yaml
rust-lang.rust-analyzer
streetsidesoftware.code-spell-checker
stylelint.vscode-stylelint
tamasfe.even-better-toml
usernamehw.errorlens
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
vivaxy.vscode-conventional-commits
yzhang.markdown-all-in-one
ziglang.vscode-zig
